import Link from "next/link";
import React from "react";
import styles from "../_filesabout/About.module.css";
// import DocumentPDF from "../_filesabout/DocumentPDF";
// import { documents } from "../_filesabout/data";

export default function DocumentPolicy({ params: { lng } }) {
  return (
    <section className={styles.sectionDoc}>
      <article className={styles.wrapDocument}>
        <div className={styles.wrapSubTitle}>
          <p className={styles.subTitle}>
            ГО «БІТ» код ЄДРПОУ 44993792 вул.Петропавлівська, 15{" "}
          </p>
          <p className={styles.subTitle}>Київ 04086 Україна</p>
          <p className={styles.subTitle}>
            +38 067 568 1788 +38 063 6286630 email:
            <a href="mailto:info@baza-trainee.tech">info@baza-trainee.tech</a>
          </p>
        </div>

        <h4 className={styles.title}>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ</h4>
        <p className={styles.text}>
          Ця Політика конфіденційності («Політика») охоплює питання збору,
          використання, розголошення, передачі та зберігання персональної
          інформації користувача.
        </p>
        <p className={styles.text}>
          Будь ласка, переконайтесь, що ви ознайомились із нашими правилами
          конфіденційності та зв’яжіться з нами, якщо у вас виникли запитання з
          цього приводу.
        </p>
        <p className={styles.text}>
          Терміни, що використовуються у цій Політиці:
        </p>
        <ul className={styles.wrapTextList}>
          <li>
            <p>
              Персональні дані – будь-які відомості про фізичну особу, яка
              ідентифікована або може бути конкретно ідентифікована;
            </p>
          </li>
          <li>
            <p>
              Суб’єкт персональних даних – ідентифікована чи така, що може бути
              ідентифікована фізична особа, персональні дані якої обробляються
              Власником персональних даних, який є відповідальним за обробку
              таких даних;
            </p>
          </li>
          <li>
            <p>
              Обробка персональних даних – будь-яка дія або сукупність дій,
              котрі вчиняються по відношенню до персональних даних або
              сукупності персональних даних, такі як збирання, реєстрація,
              накопичення, структурування, зберігання, адаптування, зміна,
              поновлення, знеособлення, використання і поширення шляхом
              передачі, розповсюдження чи іншим способом, що робить такі дані
              доступними, комбінування, обмеження чи знищення персональних
              даних, у тому числі з використанням інформаційних
              (автоматизованих) систем;
            </p>
          </li>
          <li>
            <p>
              Обмеження щодо обробки персональних даних – позначення
              персональних даних, що зберігаються, з метою обмеження їхньої
              обробки в майбутньому;
            </p>
          </li>
          <li>
            <p>
              Власник персональних даних – фізична або юридична особа, яка
              самостійно або спільно з іншими особами визначає мету обробки
              персональних даних, встановлює склад цих даних та процедури їх
              обробки;
            </p>
          </li>
          <li>
            <p>
              Розпорядник персональних даних – фізична чи юридична особа, якій
              Власником персональних даних надано право обробляти ці дані від
              імені Власника;
            </p>
          </li>
          <li>
            <p>
              Третя особа – будь-яка фізична або юридична особа, за винятком
              суб’єкта персональних даних, Власника чи Розпорядника персональних
              даних, якій Власником чи Розпорядником персональних даних
              здійснюється передача персональних даних та яка уповноважена
              здійснювати їх обробку;
            </p>
          </li>
          <li>
            <p>
              Згода суб’єкта персональних даних – добровільне волевиявлення
              фізичної особи щодо надання дозволу на обробку її персональних
              даних відповідно до сформульованої мети їх обробки, висловлене у
              формі, що дає змогу зробити висновок про надання згоди;
            </p>
          </li>
          <li>
            <p>
              IP-адреса – унікальний ідентифікатор, який використовується
              певними електронними пристроями для ідентифікації та обміну даними
              один з одним в мережі Інтернет.
            </p>
          </li>
        </ul>
        <p className={styles.text}>
          Дані, що збираються або можуть збиратися Власником:
        </p>
        <ul className={styles.wrapTextList}>
          <li>
            <p>
              контактні дані (ім’я, прізвище, посада, компанія, номер телефону,
              адреса електронної пошти, посилання на особисті сторінки в
              соціальних мережах тощо);
            </p>
          </li>
          <li>
            <p>фотографії, матеріали відео зйомки тощо.</p>
          </li>
        </ul>
        <p className={styles.text}>
          Власник також може збирати дані, які містять інформацію про доменне
          ім’я або IP-адресу, дату та тривалість перебування
          Інтернет-користувача на сайтах ГО «БІТ». Такі дані збираються
          автоматично, коли Інтернет-користувач відвідує сайти ГО «БІТ». У
          поєднанні з іншими даними ця інформація допомагає Власнику дізнатися,
          який контент є найбільш привабливим для відвідувачів. Крім того, такі
          дані допомагають Власнику виявити дестабілізацію роботи обладнання.
        </p>
        <p className={styles.text}>
          Веб-сайти ГО «БІТ» використовують файли cookies, що являють собою
          невеликі текстові файли, які розміщені на пристрої користувача для
          зберігання даних і які може читати веб- сервер в домені, що розмістив
          їх. Власник використовує файли cookies для забезпечення можливості
          авторизації користувача на веб-сайтах ГО «БІТ», аналізу роботи
          веб-сайтів, відстеження діяльності користувачів на веб-сайтах, збору
          даних трафіку та для досягнення інших законних цілей.
        </p>
        <p className={styles.text}>
          Більшість веб-браузерів автоматично використовують файли cookies,
          надаючи при цьому користувачам можливість керувати цим процесом шляхом
          їх блокування або видалення. Інструкції з блокування або видалення
          файлів cookies можна знайти в налаштуваннях конфіденційності або
          довідковій документації кожного веб-браузера.
        </p>
        <p className={styles.text}>
          ГО «БІТ» збирає ваші дані для таких цілей:
        </p>
        <ul className={styles.wrapTextList}>
          <li>
            <p>зв’язок з користувачем;</p>
          </li>
          <li>
            <p>
              направлення користувачу повідомлень, які містять інформацію про
              новини, заходи, події, які можуть бути цікавими для користувача;
            </p>
          </li>
          <li>
            <p>
              надання відповідей на запити, питання та реагування на потреби
              користувача;
            </p>
          </li>
          <li>
            <p>проведення опитувань та досліджень;</p>
          </li>
          <li>
            <p>адміністрування членства та збір внесків до ГО «БІТ»;</p>
          </li>
          <li>
            <p>
              зберігання, оновлення та аналіз даних у корпоративному програмному
              забезпеченні;
            </p>
          </li>
          <li>
            <p>
              організація та реєстрація користувача на заходи, що проводяться ГО
              «БІТ» в рамках її статутної діяльності або до проведення яких
              долучається ГО «БІТ»;
            </p>
          </li>
          <li>
            <p>
              використання користувачем веб-сайту ГО «БІТ» та його функціоналу;
            </p>
          </li>
          <li>
            <p>
              адміністрування веб-сайтів ГО «БІТ», у тому числі покращення
              роботи Інтернет-сервісів ГО «БІТ» (розробка нових функцій та
              пропозицій тощо).
            </p>
          </li>
        </ul>
        <p className={styles.text}>
          Будь ласка, зверніть увагу, що, окрім перерахованих вище цілей,
          Власник також може обробляти персональні дані для надання
          правоохоронним органам інформації, яка є необхідною для кримінального
          провадження, або якщо така обробка є необхідною для виконання іншого
          законного обов’язку, з метою захисту життєво важливого інтересу як
          суб’єкта персональних даних або інтересу іншої фізичної особи, або
          захисту будь-яких інших законних інтересів ГО «БІТ» чи третьої особи,
          які не порушують основні права та свободи як суб’єкта персональних
          даних.
        </p>
        <p className={styles.text}>
          Законний інтерес означає інтерес ГО «БІТ» в рамках здійснення її
          статутної діяльності. Коли Власник обробляє персональну інформацію в
          цілях, що відповідають його законним інтересам, він обов’язково
          збалансовує будь-який потенційний вплив на користувача та його права.
          Законні інтереси Власника автоматично не переважають над інтересами
          користувача.
        </p>
        <p className={styles.text}>
          Власник обробляє персональні дані для конкретних законних цілей, серед
          яких, зокрема:
        </p>
        <ul className={styles.wrapTextList}>
          <li>
            <p>зв’язок з користувачем;</p>
          </li>
          <li>
            <p>
              направлення користувачу електронних повідомлень, які містять
              інформацію про новини, заходи, події тощо, які можуть бути
              цікавими для користувача.
            </p>
          </li>
        </ul>
        <p className={styles.text}>
          Власник також може збирати дані, які не відносяться безпосередньо до
          конкретної людини (вони не є персональними даними). Власник може
          збирати, використовувати, передавати і розкривати такі відомості з
          будь-якою метою. При об’єднанні даних, що не є персональними, з
          персональними даними об’єднані дані будуть вважатися особистими, поки
          вони залишаються об’єднаними.
        </p>
        <p className={styles.text}>
          Власник намагається полегшити для користувача процес відстеження
          точності, повноти та актуальності його персональних даних. Власник
          буде зберігати персональну інформацію протягом періоду, необхідного
          для виконання цілей, викладених у цій Політиці. Визначаючи тривалість
          таких періодів, Власник спочатку вирішує, чи потрібно йому збирати
          персональні дані взагалі, і, якщо така потреба дійсно існує, Власник
          зберігає їх лише на строк, необхідний для реалізації мети збору
          (наприклад, на строк трудових відносин з ГО «БІТ» тощо), за винятком
          випадків, коли закон встановлює більшу тривалість зберігання.
        </p>
        <p className={styles.text}>
          Власник не надає персональні дані користувача компаніям, організаціям
          чи особам за межами членської спільноти ГО «БІТ», крім вказаних нижче
          випадків:
        </p>
        <p className={styles.text}>
          дані учасників подій, що організовуються ГО «БІТ» або до організації
          яких долучається ГО «БІТ», можуть бути надані протокольним службам
          органів державної влади та місцевого самоврядування, адміністрації
          будівель, де відбувається захід для забезпечення вільного входу,
          спікерам (модераторам) заходів за їхньої усної чи письмової згоди.
        </p>
        <p className={styles.text}>
          Лише імена, прізвища, електронні адреси, фотографії та посади
          учасників заходів, що організовуються ГО «БІТ» або до організації яких
          долучається ГО «БІТ», членів керівних органів ГО «БІТ», співробітників
          компаній-членів ГО «БІТ» можуть бути опубліковані на веб- сайті
          (веб-сайтах) ГО «БІТ».
        </p>
        <p className={styles.text}>
          ГО «БІТ» дуже серйозно ставиться до захисту персональних даних
          користувача і пропагує їх захист. Власник захищає персональні дані
          різними способами з метою збереження конфіденційності та цілісності,
          запобігання несанкціонованому використанню або розголошенню
          персональних даних та захисту персональних даних користувача від
          втрати, неправильного використання, несанкціонованого доступу,
          розголошення, зміни та знищення.
        </p>
        <p className={styles.text}>
          У кожного співробітника ГО «БІТ» є унікальний пароль для доступу до
          адміністративної частини веб-сайту, а також доступ до локальної бази
          даних.
        </p>
        <p className={styles.text}>
          Хостинг-провайдери та оператори сервісів обміну файлами забезпечують
          захист за допомогою шифрування. Деякі типи даних, які зберігаються на
          сервісі обміну файлами, можуть бути обмежені у доступі для певної
          групи користувачів. Наприклад, співробітники одного відділу не можуть
          отримати доступ до даних інших відділів.
        </p>
        <p className={styles.text}>
          Користувач має право на виправлення, видалення або доступ до своїх
          персональних даних, обмеження їхньої обробки або заперечення щодо
          обробки своїх персональних даних. Якщо обробка здійснюється за згодою
          Користувача, він має право відкликати її в будь-який час.
        </p>
        <p className={styles.text}>
          Для здійснення цих прав, будь ласка, зв’яжіться з ГО «БІТ» за адресою:{" "}
          <a href="mailto:info@baza-trainee.org">dpo@baza-trainee.org.</a>
        </p>
        <p className={styles.text}>
          Інформація, яку Власник збирає, може бути передана, збережена та
          оброблена в будь-якій країні.
        </p>
        <p className={styles.text}>
          Зокрема, Власник може передавати персональні дані сервісу розсилки
          електронних повідомлень, для розсилки інформаційних повідомлень,
          бюлетенів, запрошень, пропозицій тощо.
        </p>
        <p className={styles.text}>
          Власник також може надавати персональні дані своєму оператору сервісу
          обміну файлами, для забезпечення зберігання інформації, що на ньому
          знаходиться.
        </p>
        <p className={styles.text}>
          Дані можуть передаватися також компанії Google LLC та/або Meta
          Platforms Inc. шляхом використання платформами файлів cookies. В
          даному випадку ці компанії виступають в якості розпорядника таких
          даних.
        </p>
        <p className={styles.text}>
          Хоча інші території можуть і не мати таких самих стандартів захисту
          персональних даних, як в межах країни Користувача, Власник буде
          захищати персональні дані, які передає, відповідно до положень цієї
          Політики.
        </p>
        <p className={styles.text}>
          ГО «БІТ» залишає за собою право вносити зміни в дану політику в
          односторонньому порядку, без попереднього повідомлення. Актуальна
          версія політики доступна на вебресурсі ГО «БІТ».
        </p>
      </article>

      <Link href={`/${lng}/about`} className={styles.link}>
        Повернутись
      </Link>
    </section>
  );
}
