import Link from "next/link";
import React from "react";
import styles from "../_filesabout/About.module.css";

export default function DocumentTerms({ params: { lng } }) {
  return (
    <section className={styles.sectionDoc}>
      <article className={styles.wrapDocument}>
        <div className={styles.wrapSubTitle}>
          <p className={styles.subTitle}>
            ГО «БІТ» код ЄДРПОУ 44993792 вул.Петропавлівська, 15{" "}
          </p>
          <p className={styles.subTitle}>Київ 04086 Україна</p>
          <p className={styles.subTitle}>
            +38 067 568 1788 +38 063 6286630 email:{" "}
            <a href="mailto:info@baza-trainee.tech">info@baza-trainee.tech</a>
          </p>
        </div>
        <h4 className={styles.title}>ПРАВИЛА КОРИСТУВАННЯ САЙТОМ</h4>
        <p className={styles.text}>
          ТОВ ГО «БІТ»( ГО «БІТ») використовує веб-сайт{" "}
          <a href="https:\\baza-trainee.tech">https:\\baza-trainee.tech</a>
          https:\\baza-trainee.tech ( «Сайт») для надання загальної інформації
          про діяльність Громадської організації «БІТ». Використання Вами цього
          сайту означає Вашу згоду з цими умовами.
        </p>
        <p className={styles.text}>
          <b>Ухвалення Вами справжніх загальних умов</b>
        </p>
        <p className={styles.text}>
          Просимо приділити кілька хвилин, щоб уважно ознайомитися зі справжніми
          загальними умовами і положеннями. Своїм доступом до Сайту і його
          використанням Ви погоджуєтеся дотримуватися цих загальних умов та
          слідувати їм. Якщо Ви не згодні дотримуватися цих умов і їм слідувати,
          Ви не маєте права отримувати доступ, використовувати або завантажувати
          матеріали з цього Сайту.
        </p>
        <p className={styles.text}>
          <b>Можливість зміни наведених загальних умов</b>
        </p>
        <p className={styles.text}>
          ГО «БІТ» залишає за собою право викладати в новій редакції справжні
          загальні умови в будь-який час без попереднього повідомлення. ГО «БІТ»
          здійснює це шляхом публікації нової редакції справжніх загальних умов
          на цьому Сайті. Використання Вами цього Сайту після будь-яких таких
          змін вважається Вашою згодою дотримуватися загальних умов в новій
          редакції. Тому ми рекомендуємо вивчати загальні умови при кожному
          використанні цього Сайту.
        </p>
        <p className={styles.text}>
          <b>Політика конфіденційності</b>
        </p>
        <p className={styles.text}>
          ГО «БІТ» зобов’язується дотримуватися конфіденційності персональних
          даних користувачів цього Сайту. Політика конфіденційності,
          опублікована на цьому сайті, є описом діючих політик і практик ГО
          «БІТ» щодо персональної інформації, яка збирається ГО «БІТ» за
          допомогою цього Сайту.
        </p>
        <p className={styles.text}>
          Політика конфіденційності є частиною цих загальних умов. Якщо Ви
          погоджуєтеся дотримуватися загальних умов, то Ви даєте згоду на збір,
          використання і розкриття Вашої персональної інформації відповідно до
          політики конфіденційності цього Сайту. Просимо приділити кілька
          хвилин, щоб ознайомитися з нею.
        </p>
        <p className={styles.text}>
          У відносинах між Вами, Вашою компанією і Громадською організацією
          «БІТ» ГО «БІТ» має виняткове і одноосібне право власності на все
          права, титули і речові права щодо цього Сайту, включаючи, в тому
          числі, дизайн, характеристики, функціонал, навігацію, контент,
          оформлення інтерфейсу цього Сайту і всі дані, що збираються за
          допомогою цього Сайту, включаючи, в тому числі, всі права
          інтелектуальної власності пов’язані з ним, всі авторські права,
          патенти, товарні знаки, комерційні таємниці і ноу-хау.
        </p>
        <p className={styles.text}>
          <b>Право на зміну Сайту</b>
        </p>
        <p className={styles.text}>
          ГО «БІТ» залишає за собою право змінювати контент і функціонал цього
          Сайту будь-яким чином, обмежувати доступ до цього Сайту, закривати цей
          Сайт в будь-який час і з будь-якої причини без попереднього
          повідомлення і не несе ніякої відповідальності перед Вами або Вашою
          компанією щодо будь-яких наслідків таких змін або закриття.
        </p>
        <p className={styles.text}>
          <b> Повідомлення про авторське право і обмежена ліцензія</b>
        </p>
        <p className={styles.text}>
          Вся візуальна і звукова інформація цього Сайту (тут і далі - Контент),
          включаючи, наприклад, всі тексти, фотографії, ілюстрації, графічні
          матеріали, аудіо, відео та аудіовідеокліпи, захищена авторським
          правом.
        </p>
        <p className={styles.text}>
          Вам надається не ексклюзивна ліцензія на Контент з урахуванням
          наступних обмежень: Ви маєте право завантажувати, зберігати,
          друкувати, копіювати і спільно використовувати Контент з цього Сайту
          за умови, що Ви:
        </p>
        <ul className={styles.wrapTextList}>
          <li>
            <p>
              використовуєте Контент виключно в некомерційних цілях і для
              розвитку Ваших партнерських відносин з ГО «БІТ»;
            </p>
          </li>
          <li>
            <p>
              публікуєте або розміщуєте будь-які елементи Контенту на будь-якому
              іншому інтернет-сайті або на будь-якому іншому носії в контексті,
              аналогічному тому, в якому вона представлена на цьому Сайті;
            </p>
          </li>
          <li>
            <p>співвідносите Контент з діяльністю ГО «БІТ»;</p>
          </li>
          <li>
            <p>
              не змінюєте Контент жодним чином, а також не видаляєте і не
              змінюєте жодні повідомлення про авторські права, товарні знаки або
              конфіденційності.
            </p>
          </li>
        </ul>
        <p className={styles.text}>
          Крім випадків, коли це в прямій формі встановлено вище, Ви не маєте
          права копіювати, завантажувати, друкувати, публікувати, демонструвати,
          відтворювати, поширювати, передавати, транслювати, переводити,
          модифікувати, доповнювати, актуалізувати, компілювати, скорочувати або
          будь-яким іншим чином трансформувати або адаптувати всі або будь-які з
          елементів Контенту цього Сайту без попередньої письмової згоди ГО
          «БІТ».
        </p>
        <p className={styles.text}>
          Крім випадків, коли це в прямій формі встановлено вище, жодні права,
          титули або речові права на завантажений Контент не передаються Вам,
          коли Ви завантажуєте контент з цього Сайту. За винятком обмеженої
          неексклюзивної ліцензії, в прямій формі наданої вище, жодне положення
          цих загальних умов і справжнього Сайту не тлумачиться як надання
          будь-якої ліцензії або будь-якого іншого права щодо будь-яких
          авторських прав, прав на товарні знаки, патентних прав або інших прав
          інтелектуальної власності ГО «БІТ» або будь-якої третьої особи.
        </p>
        <p className={styles.text}>
          <b>Повідомлення про права на товарні знаки</b>
        </p>
        <p className={styles.text}>
          Усі товарні знаки, знаки обслуговування і логотипи, які демонструються
          на цьому Сайті (тут і далі - Товарні знаки), являють собою
          зареєстровані і незареєстровані товарні знаки ГО «БІТ», однієї з її
          афілійованих осіб або третіх сторін, які надали ліцензії на свої
          товарні знаки ГО «БІТ» або одній з її афілійованих осіб.
        </p>
        <p className={styles.text}>
          Крім випадків, коли це в прямій формі встановлено цими загальними
          умовами, Ви не маєте права відтворювати, демонструвати або іншим чином
          використовувати будь-який Товарний знак без попередньої письмової
          згоди ГО «БІТ».
        </p>
        <p className={styles.text}>
          <b>Добровільні пропозиції</b>
        </p>
        <p className={styles.text}>
          ГО «БІТ» вітає Ваші зауваження та коментарі по справжньому Сайту. Усі
          факти і матеріали, що надаються ГО «БІТ»за допомогою цього Сайту,
          включаючи будь-які зауваження, коментарі, ідеї, питання, розробки,
          дані тощо, не зважають конфіденційною інформацією. З цієї причини ми
          просимо Вас не надсилати нам ніяких відомостей або матеріали, які Ви
          не маєте наміру поступитися нам, включаючи, в тому числі, будь-які
          конфіденційні відомості і будь-які оригінальні креативні матеріали.
        </p>
        <p className={styles.text}>
          Направляючи кореспонденцію і/або матеріали в ГО «БІТ» за допомогою
          цього Сайту, Ви передаєте ГО «БІТ» на безоплатній основі все глобальні
          права, права власності та речові права на всі авторські права та права
          інтелектуальної власності на інформацію та / або матеріали, які Ви
          надсилаєте. ГО «БІТ» має право використовувати будь-які відомості та /
          або матеріали, які Ви надаєте за допомогою цього Сайту, і будь-які
          ідеї, концепції, ноу-хау або техніки в складі будь-яких таких
          відомостей і / або матеріали для яких би то не було цілей, включаючи,
          в тому числі, розробку, виготовлення і збут цифрового продукту з
          використанням відомостей або матеріалів без обмежень і без будь-яких
          відшкодувань на Вашу користь.
        </p>
        <p className={styles.text}>
          Проте ГО «БІТ» не використовує жодних відомостей або матеріали, які Ви
          надаєте за допомогою цього Сайту, якщо це порушує чинне законодавство
          про конфіденційність. Зокрема, ГО «БІТ» не публікує імена або іншим
          чином не робить надбанням громадськості факт надання Вами відомостей
          або матеріалів нам, якщо тільки: (a) нами не було отримано Ваше дозвіл
          на використання Вашого імені; або (b) Ви не були попередньо
          повідомлені нами про те, що матеріали або інші відомості, що надаються
          Вами в певному розділі цього Сайту, публікуються або іншим чином
          використовуються з зазначенням Вашого імені в них; або (c) ми не
          зобов’язані здійснювати це в силу дії закону.
        </p>
        <p className={styles.text}>
          Ви несете відповідальність за кореспонденцію, що направляється за
          допомогою цього Сайту, включаючи, в тому числі, відповідальність за її
          достовірність і точність.
        </p>
        <p className={styles.text}>
          Просимо звернути увагу, що надані Вами відомості (наприклад, в нашій
          формі звернення) не мають зобов’язальної дії щодо ГО «БІТ».
          Відповідно, листи, повідомлення та інше повинні спрямовуватися
          виключно на адреси, зазначені у відповідному контракті.
        </p>
        <p className={styles.text}>
          <b>Сторонні відомості</b>
        </p>
        <p className={styles.text}>
          Певні відомості, статті або інші матеріали, надані цим Сайтом,
          надаються ГО «БІТ» третіми особами. У кожному разі, коли це доцільно,
          джерела таких сторонніх матеріалів ідентифікуються. Ці сторонні
          матеріали надаються виключно для ознайомлення і зручності. ГО «БІТ» не
          надає жодних гарантій або запевнень щодо актуальності, точності,
          повноти або надійності таких матеріалів. ГО «БІТ»не несе
          відповідальності за будь-яке використання таких сторонніх відомостей.
        </p>
        <p className={styles.text}>
          <b>Посилання на інші веб-сайти ГО «БІТ»</b>
        </p>
        <p className={styles.text}>
          Справжній Сайт містить гіперпосилання на інші веб-сайти ГО «БІТ» або
          інших підрозділів ГО «БІТ» (тут і далі - Інші веб-сайти ГО «БІТ»).
          Зазначені Інші веб-сайти ГО «БІТ» є автономними і окремими
          веб-сайтами. Кожен з них виконує певну функцію. Кожен Інший веб-сайт
          ГО «БІТ», таким чином, регулюється своїми власними умовами
          використання та політикою конфіденційності. При доступі до Іншим
          веб-сайтів ГО «БІТ» по посиланнях з цього Сайту, приділіть кілька
          хвилин ознайомленню з умовами використання та політикою
          конфіденційності, опублікованими на кожному відвідуваному Вами Другому
          веб-сайті ГО «БІТ».
        </p>
        <p className={styles.text}>
          <b>Посилання на інші веб-сайти</b>
        </p>
        <p className={styles.text}>
          Справжній Сайт містить посилання на веб-сайти, які не належать ГО
          «БІТ». Ці гіперпосилання передбачені виключно для зручності посилання
          і не вважаються визнанням будь-якого матеріалу таких сторонніх
          веб-сайтів або зв’язку з їх операторами. ГО «БІТ» не контролює
          зазначені веб-сайти і не несе відповідальності за їх зміст. Доступ до
          вказаних веб-сайтаів і їх використання здійснюються виключно на Ваш
          власний ризик.
        </p>
        <p className={styles.text}>
          <b>Контакт</b>
        </p>
        <p className={styles.text}>
          Функція «контакту» на деяких веб-сайтах ГО «БІТ» дає Вам можливість
          направити відповідні питання нашим учасникам онлайн. Ця функція
          передбачена для Вашої зручності. Корисність наших відповідей на Ваші
          питання залежить від повноти і точності інформації, на якій вони
          засновані, і інших чинників поза нашим контролем
        </p>
        <p className={styles.text}>
          На деяких веб-сайтах ГО «БІТ» публікуються репрезентативні питання і
          відповіді, які, на нашу думку, можуть зацікавити інших зареєстрованих
          користувачів. Просимо не включати ніяку конфіденційну, приватну або
          персональну інформацію в питання. Ми залишаємо за собою право
          редагувати відповіді для підвищення стислості і чіткості. Просимо
          ознайомитися з розділом, що встановлює загальні умови надання
          інформації, перед відправкою нам будь-яких відомостей.
        </p>
        <p className={styles.text}>
          <b>Відмова від гарантій</b>
        </p>
        <p className={styles.text}>
          Справжній Сайт надається на умовах як є і без запевнень або гарантій
          будь-якого характеру. У всіх встановлених відповідним законом випадках
          підрозділи ГО «БІТ» відмовляються від усіх гарантій, прямих, непрямих,
          законних чи інших. Без обмеження сенсу попереднього положення і у всіх
          встановлених законом випадках підрозділи ГО «БІТ справжнім
          відмовляються від (А) всіх заяв стосовно товарного придатності,
          придатності для певної мети, прав власності та непорушення прав
          інтелектуальної власності щодо цього Сайту і його змісту; (B) гарантій
          щодо затримок, перебоїв, помилок або упущень в роботі цього Сайту або
          будь-якого його розділу; (С) гарантій щодо передачі або доставки
          контенту цього Сайту або його доступності в будь-який певний час в
          будь-якому певному місці; (D) гарантій щодо безпеки цього Сайту або
          свободи Контенту цього Сайту від вірусів, троянів або іншого коду з
          забруднюючими або деструктивними властивостями; (Е) гарантій щодо
          використання, правдивості, точності, актуальності, повноти,
          придатності, надійності або результатів використання цього Сайту,
          включаючи будь-який Контент, і (F) гарантій щодо веб-сайтів, на які з
          цього Сайту можна перейти по посиланнях.
        </p>
        <p className={styles.text}>
          <b>Обмеження відповідальності</b>
        </p>
        <p className={styles.text}>
          Використання Вами і Вашою компанією цього Сайту, його Контенту, що
          надаються за допомогою цього Сайту, здійснюється на Ваш власний ризик
          і власний ризик Вашої компанії. Підрозділи ГО «БІТ», а також, в тому
          числі, їх відповідні директори, посадові особи, працівники або
          учасники, за жодних обставин не несуть жодної відповідальності щодо
          будь-яких збитків або шкоди, що виникає з або у зв’язку з доступом до,
          використанням або нездатністю використання цього Сайту, його контенту,
          Вами або Вашою компанією, а також щодо Вашої надії або надії Вашої
          компанії на будь-яку інформацію, надану за допомогою справжнього
          сайту. Без обмеження сенсу попереднього положення підрозділи ГО «БІТ»
          не несуть жодної відповідальності за можливі помилки або упущення в
          складі контенту. Дане положення є комплексним обмеженням
          відповідальності, що застосовується до всіх яких би то не було видів
          збитку і шкоди, як прямих, так і непрямих, а також загальних,
          особливих, випадкових, непрямих, штрафних або інших, включаючи в тому
          числі припинення діяльності, втрату або пошкодження даних, втрату або
          шкоду репутації.
        </p>
        <p className={styles.text}>
          Справжнє обмеження відповідальності застосовується у всіх встановлених
          відповідним законом випадках, незалежно від підстав відповідальності:
          контракту, недбалості, делікту, суворої відповідальності або будь-яких
          інших підстав, а також навіть якщо уповноважений представник
          будь-якого з підрозділів ГО «БІТ» був повідомлений або повинен був
          бути обізнаний про можливості таких збитків і без урахування дійсності
          інших засобів захисту.
        </p>
        <p className={styles.text}>
          Якщо будь-які із зазначених обмежень відповідальності визнаються
          недійсними або нездійсненними в примусовому порядку за будь-якої
          причини, то сукупна відповідальність підрозділів ГО «БІТ» при даних
          обставинах щодо відповідальності, яка в іншому випадку була б
          обмежена, не перевищує 100,00 (сто) гривень.
        </p>
        <p className={styles.text}>
          У певних юрисдикціях заборонено встановлювати обмеження на певні
          відшкодування шкоди, тому дані обмеження відповідальності повністю або
          частково можуть не застосовуватися до Вас і / або Вашої компанії, а Ви
          і / або Ваша компанія можете мати додаткові права.
        </p>
        <p className={styles.text}>
          <b>Право, що застосовується і юрисдикція</b>
        </p>
        <p className={styles.text}>
          Справжні загальні умови регулюються, підпадають під дію і тлумачаться
          відповідно до законодавства України.
        </p>
        <p className={styles.text}>
          <b>Автономність положень</b>
        </p>
        <p className={styles.text}>
          Якщо будь-яке положення цих загальних умов буде визнано судом
          компетентної юрисдикції таким, що суперечить законодавству, то такий
          стан підлягає зміні і тлумаченню, максимально відповідним цілям і
          задачам початкового положення у всіх дозволених законом випадках, а
          інші положення цих загальних умов зберігають повну юридичну силу.
        </p>
        <p className={styles.text}>
          <b>Вичерпний характер угоди</b>
        </p>
        <p className={styles.text}>
          Справжні загальні умови являють собою вичерпну угоду між Вами, Вашою
          компанією і ГО «БІТ» щодо Вашого доступу і доступу Вашої компанії до
          даного Сайту та / або використання Вами і Вашою компанією цього Сайту.
          Справжні загальні умови не підлягають викладу в новій редакції, за
          винятком випадків, в прямій формі передбачених цими загальними
          умовами.
        </p>
        <p className={styles.text}>Дата редакції</p>
        <p className={styles.text}>
          Справжні загальні умови були в останній раз викладені в новій редакції
          19 червня 2023 р
        </p>
      </article>
      <Link href={`/${lng}/about`} className={styles.link}>
        Повернутись
      </Link>
    </section>
  );
}
