import React from "react";
import { IoClose } from "react-icons/io5";
import styles from "./Rules.module.css";

export default function RulesParticipant({ closeModal }) {
  return (
    <div className={styles.wrapModal}>
      <button type="button" onClick={closeModal} className={styles.closeBtn}>
        <IoClose className={styles.close} />
      </button>
      <article className={styles.wrapRules}>
        <h5 className={styles.title}> Загальна інформація про продукт</h5>
        <h6 className={styles.subtitle}>
          1. Цілі розробки програмного продукту.
        </h6>
        <p className={styles.text}>
          Ініціатива Baza Trainee Ukraine як освітня і тренувальна платформа
          виникає у відповідь на суспільний запит, який склався в Україні в
          2022-2023 роках в сфері працевлаштування в галузі інформаційних
          технологій і представляє собою веб- сайт, що об’єднує як користувачів
          дві соціальні групи. З однієї сторони є українці, які хочуть отримати
          спеціальність в сфері ІТ і розробки, для цього навчаються у
          відповідних вишах або на курсах, з іншої сторони є сфера громадських
          відносин у вигляді великої кількості соціальних проектів, які не
          отримують комерційного результату від своєї діяльності, але мають
          вплив на різні осередки суспільного життя. Це волонтерські і
          благодійні проекти в сфері розвитку суспільних відносин, захисту
          громадських прав і свобод, екології, культури і медіа, роботи з
          соціально вразливими групами тощо.
        </p>
        <p className={styles.text}>
          <b>Мета проекту</b> – поєднати в спільній діяльності ці категорії
          таким чином, щоб користь отримали обидві сторони. Для першої групи –
          це реальний практичний досвід створення справжнього продукту, для
          другої – цифровий продукт, що працює і сприяє розвитку соціального
          проекту.
        </p>
        <p className={styles.text}>
          <b>Задача проекту</b> – тренувати учасника на основі технологій, якими
          він володіє на даний момент, і сприяти його працевлаштуванню.
          Застосовувати при створенні проекту технології, які хоче розвивати
          учасник, перенавчання не відбувається.
        </p>
        <p className={styles.text}>
          <b>Місія проекту</b> – розвиток України як країни з високою репутацією
          кращих програмістів в світі, а також ІТ сфера як одна з вагомих сфер
          діяльності в економіці країни через залучення до роботи будь-яких
          верств населення без обмежень.
        </p>
        <h6 className={styles.subtitle}>2. Цільова аудиторія проєкту.</h6>
        <p className={styles.text}>
          Зі сторони учасників: <br />
          1. Студенти вишів. <br />
          2. Студенти курсів в сфері ІТ. <br />
          3. Ті, хто хоче опанувати нову професію в сфері ІТ незалежно від віку
          і попередньої спеціальності, які пройшли відповідний курс із своєї
          спеціалізації. <br />
          4. Переселенці з України, які знаходяться за кордоном і хочуть
          опанувати ІТ спеціальність і проходять навчання. <br />
          5. Ветерани війни з Росією.
        </p>
        <h6 className={styles.subtitle}>3. Регламент співпраці сторін</h6>
        <p className={styles.text}>
          3.1. Участь волонтера в проєкті є добровільною і неоплатною. Волонтер
          має право залишити проєкт в будь-який момент без пояснення причин і з
          попередженням про припинення активності. Замовник має право
          відсторонити волонтера від участі у випадку систематичного (не менш
          двох раз) порушення правил проєкту і після письмового про це
          попередження.
        </p>
        <p className={styles.text}>
          3.2. У разі зміни або поповнення Замовником списку завдань до
          реалізації термін здачі проєкту може бути переглянутий і змінений, про
          що Виконавець зобов’язується своєчасно повідомляти Замовника.
        </p>
        <p className={styles.text}>
          3.3. Якщо Замовник звертається до Виконавця із проханням роз’яснити
          регламент роботи із певним, конкретним функціоналом програмного
          продукту більше 2-х разів, Виконавець в цілях економії часу обох
          сторін може створити інструкцію для певного конкретного функціонала у
          зручному для Замовника форматі на вибір (текст, фото, відео, аудіо).
        </p>
        <p className={styles.text}>
          3.4. Узгодження будь-якого пункту між Замовником і Виконавцем
          відбувається не більше трьох разів (варіантів). Після цього
          затверджується варіант Замовника.
        </p>
        <p className={styles.text}>
          3.5. Після передачі доступів по проєкту Замовник має 10 робочих днів
          для перевірки функціоналу та дизайну програмного продукту на
          відповідність поставленим завданням. У випадку знаходження помилок або
          відсутності певного функціонала, який був описаний у затвердженому
          сторонами-учасниками технічному завданні, Замовник має можливість
          звернутися до Виконавця у письмовій формі (за допомогою email-листа,
          чи повідомлення у месенджері) із вимогою допрацювати відповідний
          функціонал чи дизайн продукту. В іншому випадку, проєкт вважається
          прийнятим, а зобов’язання сторін виконаними.
        </p>
        <p className={styles.text}>
          3.6. Усі матеріали, що потрібні чи можуть бути потрібні для наповнення
          аплікації (фото, відео, тексти, і т.п.), розміщуються самим Замовником
          на сайті, після прийому проєкту. Виконавець в свою чергу
          зобов’язується надати Замовнику інструкцію по роботі з
          адміністративною панеллю аплікації (в тому числі по наповненні
          аплікації інформацією).
        </p>
        <p className={styles.text}>
          3.7. Програмний продукт після закінчення буде опубліковано на
          платформі Baza Trainee Ukraine в якості презентації проєкту.
        </p>
        <p className={styles.text}>
          3.8. Участь волонтера в проєкті відбувається за принципом «я знаю, як
          можна це зробити, і я зроблю». Позиція «я знаю, як це можна зробити,
          зробіть ось так» не є корисною для проєкту.
        </p>
        <p className={styles.text}>
          3.9. На проєкті є два способу участі: індивідуальний і командний.
          Робота над проєктом відбувається в команді. Кожна команда визначає
          team-lead, який концентрує інформацію з зустрічей з керівниками
          проєкту і замовниками і доносить її до членів команди. Рішення про
          розподілення функцій в команді приймається колегіально і добровільно в
          залежності від знань і умінь волонтера. Метою роботи команди є
          злагоджена робота і виконання задачі проєкту.
        </p>
        <p className={styles.text}>
          3.10. Команда приймає розклад зустрічей як мінімум двічі на тиждень з
          метою обговорення і узгодження поточних питань. Команда також може
          збиратись в будь-який момент з метою комунікації і є вільною в виборі
          каналу спілкування.
        </p>
        <p className={styles.text}>
          3.11. Результати роботи команди у вигляді документів і посилань в
          обов`язковому порядку і в визначений термін вивантажуються до дошки
          Trello. Невиконання цього пункту може призвести до відсторонення
          волонтера від командної роботи.
        </p>
        <p className={styles.text}>
          3.12. Комунікація учасників відбувається в мережі Discord ( з
          розбивкою на сервери і тематичні канали) Для групових зустрічей
          використовуються Discord, Telegram. В якості програмного забезпечення
          для управління проєктом використовується Trello.
        </p>
        <p className={styles.text}>
          3.13. Волонтер є власником свого інтелектуального продукту (коду,
          дизайну) і може використовувати його на власний розсуд для формування
          власного портфоліо. Разом з цим волонтер надає права на використання
          такої розробки як частини загального програмного продукту для його
          функціонування виключно для соціальних некомерційних продуктів. В
          випадку, коли волонтер залишає проєкт під час його тривання, наробітки
          волонтера залишаються на проєкті для використання в командній роботі.
        </p>
        <p className={styles.text}>
          3.14. За бажанням волонтера його участь в команді проєкту буде
          оприлюднена шляхом розміщення в складі команди його акаунту в
          соціальній мережі LinkedIn.
        </p>
        <p className={styles.text}>
          3.15. Брати участь в інших подібних волонтерських програмах під час
          розробки не дозволяється. По-перше, внаслідок існування ділової етики,
          за якої люди не працюють на двох роботах без домовленості з
          роботодавцем, по-друге, оскільки об`єкт в таких програмах один -
          соціальна сфера, відбувається розмивання стандартів процесу розробки,
          що є неприпустимим і протирічить цілі Бази. Якщо у учасника
          залишається вільний час - можна брати 2,3 і т.д. проєкт на Базі.
        </p>
        <p className={styles.text}>
          3.16. На проєкті існують правила, відповідальність і дисципліна, які
          витікають з вимоги створити працюючий продукт, а також повага і
          доброзичливість в спілкуванні. Якщо волонтер своїми діями гальмує
          роботу команди, не приносить користі, не виявляє ініціативи, він може
          залишатись на проєкті і тренувати необхідні навички індивідуально, але
          він не бере участі в обговореннях, його матеріали не беруться до
          роботи в командному продукті. Волонтер при цьому має право на референс
          від НГО, референс буде відображати роль волонтера на проєкті.
        </p>
        <p className={styles.text}>
          3.17. Взаємодія волонтера із третьою стороною (Замовником) за вимогою
          Замовника може відбуватись з підписанням договорів, угод, NDA тощо.
          1.3.17. Даний документ, а також всі матеріали, що згадуються у ньому,
          являють собою конфіденційну інформацію. Виконавець зобов’язується не
          розголошувати дану інформацію третім сторонам без попередньої згоди на
          те від Замовника.
        </p>
        <p className={styles.text}>
          3.18. Надання і обробка персональних даних волонтера відбувається з
          дотриманням вимог поточного законодавства України про захист
          персональних даних.
        </p>

        <b>З правилами участі ознайомлений\ознайомлена, погоджуюсь</b>
      </article>
    </div>
  );
}
