import review1 from "../../../../../../public/images/reviews/review1.png";
import review2 from "../../../../../../public/images/reviews/review2.png";
import review3 from "../../../../../../public/images/reviews/review3.png";

export const reviews = [
  {
    id: "1",
    name: "Олена",
    special: "учасниця, QA",
    date: "червень 2023",
    foto: review1,
    review:
      "“Я останні два тижні щодня думаю про те, що на Базу варто було прийти мінімум для того, щоб усвідомити значущість роботи дизайнера в розробці ПЗ”",
  },
  {
    id: "2",
    name: "Світлана",
    special: "учасниця, QA",
    date: "червень 2023",
    foto: review2,
    review:
      "“Я останні два тижні щодня думаю про те, що на Базу варто було прийти мінімум для того, щоб усвідомити значущість роботи дизайнера в розробці ПЗ”",
  },
  {
    id: "3",
    name: "Марія",
    special: "учасниця, QA",
    date: "червень 2023",
    foto: review3,
    review:
      "“Я останні два тижні щодня думаю про те, що на Базу варто було прийти мінімум для того, щоб усвідомити значущість роботи дизайнера в розробці ПЗ”",
  },
];
