{
  "SPECIALITY": "",
  "special_title": "Запрошуємо до участі",
  "special_1_text1": "UI/UX-дизайнери спеціалізуються на зручності і зовнішньому вигляді програм і сайтів. Саме вони створюють зручний, привабливий і зрозумілий дизайн, який дозволяє ясно і ефективно користуватись продуктом.",
  "special_1_text2": "Вебдизайнер – це фахівець, який створює візуальне оформлення бренду в інтернеті. Він проєктує інтерфейси вебсайтів, інтернет-магазинів, лендингів, програм для замовника. Займається логічною та візуальною частиною продукту.",

  "special_2_text1": "Frontend є клієнтською стороною веб-програми або веб-сайту. Тож  frontend developer — це саме та людина, яка створює привабливий і функціональний користувальницький інтерфейс, сприяє поліпшенню досвіду користувача.",
  "special_2_text2": "Фронтенд розробник — це спеціаліст у галузі веб-розробки, який займається створенням інтерфейсу для веб-додатків або веб-сайтів. Він відповідає за розробку та реалізацію клієнтської частини програми.",

  "special_3_text1": "Бекенд розробник відповідає за створення та налаштування серверної частини додатку, включаючи логіку обробки даних, взаємодію з базами даних, розробку API та забезпечення захисту інформації.",
  "special_3_text2": "Бекенд відповідає за взаємодію користувача з внутрішніми даними, які потім відображає фронтенд. Просто кажучи, це те, що приховано від очей користувача і відбувається поза його браузером та комп'ютером.",

  "special_4_text1": "Fullstack-розробники володіють навичками програмування як фронтенду так і бекенду. Вони можуть розробити повноцінний продукт від початку до кінця і цінуються на ринку як універсальні фахівці.",
  "special_4_text2": "Full-stack розробник – це спеціаліст, який працює над усіма аспектами проекту. Він займається як front-end, і back-end розробкою. Він вміє писати код різними мовами програмування та знайомий з різними технологіями та патернами. ",

  "special_5_text1": "QA-інженер відповідає за розробку планів тестування додатків та сайтів. Тестувальник виявляє недоліки в роботі продукту, а що найважливіше — допомагає уникнути їх у майбутньому.",
  "special_5_text2": "Тестувальник покращує програми, але не пише код. Він знаходить помилки (баги), описує їх і передає розробникам. Простими словами, тестувальник стежить, щоб усе правильно працювало та відповідало вимогам.",

  "special_6_text1": "Project Manager – це нетехнічний спеціаліст, який займається управлінням проектами: розставляє пріоритети по завданням, планує та контролює їх виконання, а також він є ключовою ланкою у комунікації між замовником та командою розробників.",
  "special_6_text2": "Зазвичай проєктний менеджер відповідає за «трикутник проєкту» — час виконання, бюджет і скоуп (обсяг роботи). Та в різних компаніях і в різних проєктах обов’язки Project Manager можуть суттєво відрізнятися.",
  "special_btn": "Прочитати правила",

  "STAGES": "",
  "stage_title": "Як долучитись до проєкту",
  "stage_1_title": "Заповнення анкети",
  "stage_1_text1": "Заповнити анкету на сайті, натиснувши кнопку Приєднатись до спільноти",
  "stage_1_text2": "Прийняти запрошення на вступ до серверу в Discord",
  "stage_1_text3": "Додати до свого ніку спеціалізацію, щоб команда могла ідентифікувати вашу роль",
  "stage_2_title": "Прийміть запрошення",
  "stage_2_text1": "Прийняти запрошення до серверу Baza Trainee Ukraine, яке надійде після заповнення анкети протягом 48 годин",
  "stage_2_text2": "Слідкувати щотижня за об'явами про старт проєктів в каналі Загальний",
  "stage_2_text3": "Прийняти запрошення до серверу обраного проєкту і знайомитись із своєю новою командою",
  "stage_3_title": "Пройдіть онбордінг",
  "stage_3_text1": "Пройти відео-онбординг про правила участі і роботи в ПЗ для керування проєктами",
  "stage_3_text2": "Підтвердіть згоду на участь в проєкті та NDA",
  "stage_3_text3": "Прийняти запрошення до серверу обраного проєкту і знайомитись із своєю новою командою",
  "stage_4_title": "Комунікація з командою",
  "stage_4_text1": "Узгодити з командою розклад зустрічей і об'єм обраних завдань",
  "stage_4_text2": "Виконати завдання, випустити продукт і зголосити про наявність практичного досвіду",
  "stage_4_text3": "Надати резюме до рекрутингової агенції Baza Skill. Більше проєктів — більше шансів на співбесіду!",

  "ADVANTAGES": "",
  "advant_title": "Переваги стажування",
  "advant_text1": "Застосовуємо і підтверджуємо теоретичні знання",
  "advant_text2": "Набуваємо досвіду роботи в команді",
  "advant_text3": "Позбуваємось невпевненості, знижуємо стрес",
  "advant_text4": "Розуміємо, для чого виконується проєкт",
  "advant_text5": "Формуємо портфоліо з реальними проектами",
  "advant_text6": "Обираємо роботодавця свідомо",
  "advant_btn": "Приєднатись до спільноти"
}
