{
  "SPECIALITY": "",
  "special_title": "Zapraszamy do udziału",
  "special_1_text1": "Projektanci UI/UX specjalizują się w użyteczności i wyglądzie programów i stron. To oni tworzą wygodny, atrakcyjny i przejrzysty design, który pozwala na przejrzyste i efektywne korzystanie z produktu.",
  "special_1_text2": "Projektant stron internetowych to specjalista, który tworzy projekt wizualny marki w Internecie. Projektuje interfejsy stron internetowych, sklepów internetowych, stron docelowych i programów dla klienta. Zajmuje się logiczną i wizualną częścią produktu.",
  "special_2_text1": "Frontend to strona kliencka aplikacji internetowej lub strony internetowej. Dlatego frontend developer to właśnie osoba, która tworzy atrakcyjny i funkcjonalny interfejs użytkownika, przyczynia się do poprawy doświadczenia użytkownika.",
  "special_2_text2": "Programista frontendowy to specjalista ds. tworzenia stron internetowych, który tworzy interfejs aplikacji internetowych lub stron internetowych. Odpowiada za opracowanie i wdrożenie klienckiej części programu.",
  "special_3_text1": "Programista backendu odpowiada za utworzenie i konfigurację backendu aplikacji, w tym za logikę przetwarzania danych, interakcję z bazami danych, rozwój API i zapewnienie bezpieczeństwa informacji.",
  "special_3_text2": "Backend odpowiada za interakcję użytkownika z danymi wewnętrznymi, które następnie są wyświetlane przez frontend. Mówiąc najprościej, jest to coś, co jest ukryte przed oczami użytkownika i dzieje się poza jego przeglądarką i komputerem.",
  "special_4_text1": "Programiści Fullstack mają umiejętności programowania zarówno po stronie klienta, jak i backendu (po stronie serwera). Potrafią opracować kompletny produkt od początku do końca i są cenieni na rynku jako uniwersalni specjaliści.",
  "special_4_text2": "Fullstack developer to specjalista, który pracuje nad wszystkimi aspektami projektu. Zajmuje się zarówno rozwojem front-endu, jak i back-endu. Potrafi pisać kod w różnych językach programowania i zna różne technologie i wzorce.",
  "special_5_text1": "nżynier ds. kontroli jakości jest odpowiedzialny za opracowywanie planów testów aplikacji i witryn. Tester wykrywa wady w działaniu produktu, a co najważniejsze pomaga ich uniknąć w przyszłości.",
  "special_5_text2": "Tester poprawia programy, ale nie pisze kodu. Znajduje błędy (bugs), opisuje je i przekazuje programistom. Mówiąc najprościej, tester pilnuje, czy wszystko działa poprawnie i spełnia wymagania.",
  "special_6_text1": "Project Manager to specjalista nietechniczny, który zarządza projektami: ustala priorytety zadań, planuje i monitoruje ich realizację, a także jest kluczowym ogniwem w komunikacji pomiędzy klientem a zespołem programistów.",
  "special_6_text2": "Zwykle kierownik projektu odpowiada za „trójkąt projektu” – czas, budżet i zakres (zakres prac). Jednak w różnych firmach i przy różnych projektach obowiązki Project Managera mogą się znacząco różnić.",
  "special_btn": "Dołącz do społeczności",

  "STAGES": "",
  "stage_title": "Jak dołączyć do projektu",
  "stage_1_title": "Wypełnienie ankiety",
  "stage_1_text1": "Wypełnij ankietę znajdującą się na stronie internetowej, klikając przycisk Dołącz do społeczności",
  "stage_1_text2": "Zaakceptuj zaproszenie do dołączenia do serwera w Discord",
  "stage_1_text3": "Dodaj specjalizację do swojego pseudonimu, aby zespół mógł zidentyfikować Twoją rolę",
  "stage_2_title": "Przyjąć zaproszenie",
  "stage_2_text1": "Zaakceptuj zaproszenie na serwer Baza Trainee Ukraine, które nadejdzie po wypełnieniu formularza w ciągu 48 godzin",
  "stage_2_text2": "Śledź cotygodniowe ogłoszenia o rozpoczęciu projektów w kanale Ogólne",
  "stage_2_text3": "Zaakceptuj zaproszenie na serwer wybranego projektu i poznaj swój nowy zesp",
  "stage_3_title": "Dołącz do nas",
  "stage_3_text1": "Nakręć film wprowadzający na temat zasad uczestnictwa i pracy w programie do zarządzania projektami",
  "stage_3_text2": "Potwierdź zgodę na udział w projekcie oraz umowę NDA",
  "stage_3_text3": "Zaakceptuj zaproszenie na serwer wybranego projektu i poznaj swój nowy zespół",
  "stage_4_title": "Komunikacja z zespołem",
  "stage_4_text1": "Uzgodnij z zespołem harmonogram spotkań i zakres wybranych zadań",
  "stage_4_text2": "Wykonaj zadanie, wypuść produkt i zadeklaruj dostępność doświadczenia praktycznego",
  "stage_4_text3": "Prześlij swoje CV do agencji rekrutacyjnej Baza Skill. Więcej projektów - więcej szans na rozmowę kwalifikacyjną!",

  "ADVANTAGES": "",
  "advant_title": "Korzyści ze stażu",
  "advant_text1": "Stosujemy i potwierdzamy wiedzę teoretyczną",
  "advant_text2": "Doświadczenie zdobywamy pracując w zespole",
  "advant_text3": "Pozbywamy się niepewności i redukujemy stres",
  "advant_text4": "Rozumiemy, czemu ma służyć ten projekt",
  "advant_text5": "Tworzymy portfolio realnych projektów",
  "advant_text6": "Wybieramy pracodawcę świadomie",
  "advant_btn": "Dołącz do społeczności"
}
