import React from "react";
import styles from "../_filesblog/Blog.module.css";
import PostId from "../_filesblog/Postld";

const post = {
  id: "1",
  date: "12.06.2024",
  link: "hello",
  url: "https://cdn.pixabay.com/photo/2015/09/04/23/28/wordpress-923188_1280.jpg",
  title:
    "Останні тенденції розробки програмного забезпечення, які варто побачити у 2024 році",
  text1:
    "За останні кілька років сфера розробки програмного забезпечення зазнала революційних інновацій та трансформаційних змін. У міру того, як світовий ринок розробки програмного забезпечення наближається до оціночної оцінки в 507,2 мільярда доларів, трансформаційний вплив нових тенденцій стає все більш очевидним. Розуміння та адаптація останніх тенденцій розробки програмного забезпечення є стратегічною необхідністю для компаній, які прагнуть підтримувати конкурентоспроможність та актуальність. ",
  text2:
    "Навіщо витрачати свій час на вивчення цих тенденцій? Переваги багатогранні. Бути в курсі останніх досягнень дозволяє вашому бізнесу використовувати найсучасніші технології, що призводить до підвищення операційної ефективності, покращення якості обслуговування клієнтів і явної ринкової переваги. Незалежно від того, чи є ви технічним директором, менеджером проектів або підприємцем, розуміння цих тенденцій має важливе значення для максимізації потенціалу ваших програмних проектів і залишатися в авангарді технологічного прогресу.",
};

export default async function Post({ params: { id } }) {
  return (
    <section className={styles.blog}>
      <h4 className={styles.titlePost}>{post.title}</h4>
      <PostId post={post} />
    </section>
  );
}
