import bg1 from "../../../../../../public/imgtrainee/speciality/bg-1.webp";
import bg2 from "../../../../../../public/imgtrainee/speciality/bg-2.webp";
import bg3 from "../../../../../../public/imgtrainee/speciality/bg-3.webp";
import bg4 from "../../../../../../public/imgtrainee/speciality/bg-4.webp";
import bg5 from "../../../../../../public/imgtrainee/speciality/bg-5.webp";
import bg6 from "../../../../../../public/imgtrainee/speciality/bg-6.webp";

export const specialities = [
  {
    id: "1",
    img: bg1,
    title: "UIUX designer",
    text1:
      "Також дизайнер створює елементи фірмового стилю (зображення, персонажі, шрифти, кольори, слогани) та інші візуальні елементи, які бренд розміщує на товарах, рекламі, в соцмережах тощо.",
    text2:
      "Дизайнер – одна з головних професій у IT-галузі. Все, що ти бачиш в інтернеті, хтось вигадав і намалював. Дизайнери потрібні кожному бренду, тож вакансій завжди багато. Це професія із величезними перспективами і необмеженим розвитком.",
  },
  {
    id: "2",
    img: bg2,
    title: "Frontend",
    text1:
      "Також дизайнер створює елементи фірмового стилю (зображення, персонажі, шрифти, кольори, слогани) та інші візуальні елементи, які бренд розміщує на товарах, рекламі, в соцмережах тощо.",
    text2:
      "Дизайнер – одна з головних професій у IT-галузі. Все, що ти бачиш в інтернеті, хтось вигадав і намалював. Дизайнери потрібні кожному бренду, тож вакансій завжди багато. Це професія із величезними перспективами і необмеженим розвитком.",
  },
  {
    id: "3",
    img: bg3,
    title: "Backend",
    text1:
      "Також дизайнер створює елементи фірмового стилю (зображення, персонажі, шрифти, кольори, слогани) та інші візуальні елементи, які бренд розміщує на товарах, рекламі, в соцмережах тощо.",
    text2:
      "Дизайнер – одна з головних професій у IT-галузі. Все, що ти бачиш в інтернеті, хтось вигадав і намалював. Дизайнери потрібні кожному бренду, тож вакансій завжди багато. Це професія із величезними перспективами і необмеженим розвитком.",
  },
  {
    id: "4",
    img: bg4,
    title: "Fullstack engineer",
    text1:
      "Також дизайнер створює елементи фірмового стилю (зображення, персонажі, шрифти, кольори, слогани) та інші візуальні елементи, які бренд розміщує на товарах, рекламі, в соцмережах тощо.",
    text2:
      "Дизайнер – одна з головних професій у IT-галузі. Все, що ти бачиш в інтернеті, хтось вигадав і намалював. Дизайнери потрібні кожному бренду, тож вакансій завжди багато. Це професія із величезними перспективами і необмеженим розвитком.",
  },
  {
    id: "5",
    img: bg5,
    title: "QA Manual engineer",
    text1:
      "Також дизайнер створює елементи фірмового стилю (зображення, персонажі, шрифти, кольори, слогани) та інші візуальні елементи, які бренд розміщує на товарах, рекламі, в соцмережах тощо.",
    text2:
      "Дизайнер – одна з головних професій у IT-галузі. Все, що ти бачиш в інтернеті, хтось вигадав і намалював. Дизайнери потрібні кожному бренду, тож вакансій завжди багато. Це професія із величезними перспективами і необмеженим розвитком.",
  },
  {
    id: "6",
    img: bg6,
    title: "Project Manager",
    text1:
      "Також дизайнер створює елементи фірмового стилю (зображення, персонажі, шрифти, кольори, слогани) та інші візуальні елементи, які бренд розміщує на товарах, рекламі, в соцмережах тощо.",
    text2:
      "Дизайнер – одна з головних професій у IT-галузі. Все, що ти бачиш в інтернеті, хтось вигадав і намалював. Дизайнери потрібні кожному бренду, тож вакансій завжди багато. Це професія із величезними перспективами і необмеженим розвитком.",
  },
];
