{
  "SPECIALITY": "",
  "special_title": "We invite you to participate",
  "special_1_text1": "UI/UX designers specialize in the usability and appearance of applications and websites. They create convenient, attractive, and intuitive designs that allow users to navigate and utilize the product clearly and efficiently.",
  "special_1_text2": "A web designer is a specialist who creates the visual representation of a brand on the internet. They design the interfaces of websites, online stores, landing pages, and applications for clients. They handle both the logical and visual aspects of the product.",
  "special_2_text1": "Frontend is the client side of a web application or website. Therefore, a frontend developer is exactly the person who creates an attractive and functional user interface, contributes to the improvement of the user experience.",
  "special_2_text2": "A frontend developer is a web development specialist who creates the interface for web applications or websites. He is responsible for the development and implementation of the client part of the program.",
  "special_3_text1": "A back-end developer is responsible for creating and configuring the server-side of an application, including data processing logic, interaction with databases, API development, and ensuring information security.",
  "special_3_text2": "The backend is responsible for user interaction with internal data, which is then displayed by the frontend. Simply put, it is something that is hidden from the user's eyes and happens outside his browser and computer.",

  "special_4_text1": "Fullstack developers have programming skills in both frontend (client-side) and backend (server-side) development. They are capable of developing a complete product from start to finish and are highly valued in the market as versatile professionals.",
  "special_4_text2": "A full-stack developer is a specialist who works on all aspects of a project. He is engaged in both front-end and back-end development. He can write code in different programming languages ​​and is familiar with different technologies and patterns.",
  "special_5_text1": "A QA engineer is responsible for developing testing plans for applications and websites. They identify issues in the functionality of the product, and most importantly, they help prevent these issues from occurring in the future.",
  "special_5_text2": "A tester improves programs but doesn't write code. They find errors (bugs), describe them, and report them to developers. Simply put, a tester ensures that everything works correctly and meets the requirements.",
  "special_6_text1": "A Project Manager is a non-technical specialist who manages projects: prioritizes tasks, plans and monitors their execution, and is also a key link in communication between the customer and the development team.",
  "special_6_text2": "Usually, the project manager is responsible for the \"project triangle\" - time, budget and scope (scope of work). But in different companies and in different projects, the responsibilities of a Project Manager can differ significantly.",
  "special_btn": "Read the rules",

  "STAGES": "",
  "stage_title": "How to join the project",
  "stage_1_title": "Filling out the questionnaire",
  "stage_1_text1": "Fill out the questionnaire on the website by clicking the Join the community button",
  "stage_1_text2": "Accept the invitation to join the server in Discord",
  "stage_1_text3": "Add a specialization to your nickname so that the team can identify your role",
  "stage_2_title": "Accept the invitation",
  "stage_2_text1": "Accept the invitation to the Baza Trainee Ukraine server, which will arrive after filling out the form within 48 hours",
  "stage_2_text2": "Follow weekly announcements about the start of projects in the General channel",
  "stage_2_text3": "Accept the invitation to the server of the selected project and get to know your new team",
  "stage_3_title": "Get onboarded",
  "stage_3_text1": "Take a video onboarding about the rules of participation and work in the project management software",
  "stage_3_text2": "Confirm the agreement to participate in the project and the NDA",
  "stage_3_text3": "Accept the invitation to the server of the selected project and get to know your new team",
  "stage_4_title": "Communication with the team",
  "stage_4_text1": "Agree with the team on the schedule of meetings and the volume of selected tasks",
  "stage_4_text2": "Complete the task, release the product and declare the availability of practical experience",
  "stage_4_text3": "Submit your resume to the Baza Skill recruiting agency. More projects — more chances for an interview!",

  "ADVANTAGES": "",
  "advant_title": "Benefits of internship",
  "advant_text1": "We apply and confirm theoretical knowledge",
  "advant_text2": "We gain experience working in a team",
  "advant_text3": "We get rid of uncertainty, reduce stress",
  "advant_text4": "We understand what the project is for",
  "advant_text5": "We form a portfolio of real projects",
  "advant_text6": "We carefully choose an employer",
  "advant_btn": "Join the community"
}
